<!DOCTYPE html>
<html>
<head>
    <title>Home</title>
</head>
<body>
<h1>Welcome</h1>
<ul>
    <li><a href="users/create">Create User</a></li>
    <li><a href="users">View Users</a></li>
</ul>
</body>
</html>

<%--Да! index.jsp - это особый файл в веб-приложениях Java:
    Это страница по умолчанию, которая открывается автоматически при обращении к корню сайта или папки
    Название "index" имеет важное значение, так как веб-серверы настроены искать именно этот файл первым
    Работает как главная страница сайта (как index.html в обычных сайтах)

Примеры:
    При обращении к http://localhost:8080/myapp/ сервер автоматически откроет index.jsp
    Можно создавать index.jsp в подпапках, они будут стартовыми страницами для этих папок
--%>